Repository: GENIA-Americas/Glapagos-Backend
Catalog: api/api/notebooks/locale/*/LC_MESSAGES/django.po
Languages: es

source: User does not have a linked Google account.
es: El usuario no tiene una cuenta de Google enlazada.

source: A notebook already exists for this user.
es: Ya existe un notebook para este usuario.

source: Notebook cannot be found. Check if you have permission to access this notebook.
es: No se pudo encontrar el notebook. Verifique que tenga permisos suficientes.

source: You do not have permission to perform this action on the notebook instance.
es: No tiene permisos para ejecutar esta acción sobre la instancia.

source: Error starting the notebook.
es: Error iniciando el notebook.

source: Error stopping the notebook.
es: Error deteniendo el notebook.

source: Error destroying the notebook.
es: Error eliminando el notebook.

source: Notebook in invalid state.
es: El notebooks se encuentra en un estado inválido.

source: The zone '{zone}' is not valid
es: La zona '{zone}' no es válida.

source: Invalid notebook name after normalization.
es: El nombre del notebook es inválido después de la normalización.

source: An instance with these characteristics cannot be created in the zone: {zone}.
es: No puede crearse una instancia con estas características en la zona: {zone}.

source: At this time, we do not have the resources available to allocate to an instance with these characteristics in: {zone}.
es: En estos momentos no contamos con recursos para asignar a una instancia con estas características en: {zone}.

source: Instance {instance_id} not found
es: La instancia {instance_id} no se puedo encontrar.

source: You do not have permission to create a notebook with these properties.
es: No tiene permisos para crear un notebook con esas propiedades.

source: Notebook started successfully
es: El notebook fue iniciado exitosamente.

source: Notebook stopped successfully
es: El notebook fue detenido exitosamente.
