Repository: GENIA-Americas/Glapagos-Backend
Catalog: api/api/datasets/locale/*/LC_MESSAGES/django.po
Languages: es

source: Invalid url or file doesn't exist
es: Url invalida o archivo inexistente

source: Couln't identify provider in url, or maybe is not register in providers
es: No se pudo identificar el provider de la url o quiza no esta registrado en providers

source: Csv request failed
es: Peticion invalida csv

source: Url name extracted incorrectly
es: Nombre desde url extraido incorrectamente

source: The file structure could not be determined. Please check if the file is corrupted.
es: No se pudo determinar la estructura del archivo. Por favor, verifica si el archivo está corrupto.

source: Upload failed
es: Error en la carga del archivo.

source: An error occurred while mounting data in BigQuery.
es: Ocurrió un error al montar los datos en BigQuery.

source: Query execution failed
es: Ejecución de query fallida

source: Transformation failed
es: Transformación fallida

source: Chart limit exceeded: The selected field contains too many distinct categories.
es: Se excedió el límite del gráfico: El campo seleccionado contiene demasiadas categorías distintas y no es posible representarlas.

source: Schema cannot be updated.
es: No se pudo actualizar el esquema del dataset.

source: A 'Table' object cannot have itself as its parent.
es: Un objeto 'Tabla' no puede ser su propio padre.

source: Column '{column}' not found in the table schema.
es: La columna '{column}' no se encontró en el esquema de la tabla.

source: The filetype does not match with the extension
es: El tipo de archivo no coincide con la extensión

source: Only CSV, TXT, and JSON files are allowed.
es: Solo se permiten archivos CSV, TXT y JSON

source: The number of columns in the schema does not match the number of columns in the CSV file.
es: La cantidad de columnas en el esquema no coincide con la cantidad de columnas en el archivo CSV

source: You must indicate in the schema that the column can accept null values.
es: Debe marcar en el esquema que la columna puede aceptar valores nulos.

source: Column is required but contains null values:
es: La columna está marcada como requerida pero contiene valores nulos:

source: Column should be of type
es: La columna debe ser de tipo

source: You must ensure that all rows are of this data type or modify the schema.
es: Debe asegurarse que todas las filas sean de este tipo de datos o modificar el esquema.

source: Column names must start with a letter and can only contain alphanumeric characters. Modify the column names in the source file or in the schema.
es: Los nombres de las columnas deben empezar con una letra y solo pueden contener caracteres alfanuméricos. Modifique el nombre de las columnas en el archivo de orígen o en el esquema

source: The preview field must be a string for CSV or TXT files.
es: El campo preview debe ser de tipo 'string' para archivos CSV o TXT.

source: Invalid extension, all files should have the same file extension
es: Extensión invalida, todos los archivos deberian tener la misma extension de archivo

source: You must remove the blank rows at the end of the file.
es: Debe eliminar las filas en blanco al final del archivo.

source: Invalid JSON format in schema.
es: Formato JSON inválido en la definición del esquema

source: Unable to determine the file schema due to missing or incomplete parameters.
es: No es posible determinar el esquema debido a parámetros incompletos o faltantes.

source: Schema autodetection cannot be used simultaneously with a provided schema.
es: No puede utilizarse la autodetección del esquema con su definición manual.

source: File was not found for upload_type file
es: Ningun archivo fue encontrado para el upload_type file

source: Url was not found for upload_type url
es: No se encontro url para el upload_type url

source: Missing or incomplete parameters for CSV files.
es: Parámetros faltantes o incompletos para el archivo CSV

source: '{option}' is a mandatory field for {transformation} transformation
es: '{option}' es un campo obligatorio para la transformación {transformation}

source: You do not have permission to transform this table because you are not the owner and the table is not public.
es: No tiene permisos suficientes para transformar esta tabla porque no es el propietario y la tabla no es pública.

source: If you want to create a new table, you must specify its privacy setting.
es: Si desea crear una nueva table debe especificar su configuración de privacidad.

source: Field '{field}' does not exist in the dataset schema
es: El campo '{field}' no existe en el esquema del dataset.

source: No objects found in this folder
es: No se encontraron objetos en esta carpeta

source: Invalid or forbidden url, check that your bucket has the correct permissions
es: Url inválida o no está autorizada, revisa si tienes los permisos correctos en el bucket

source: Error while applying transformation {transformation} over {field}
es: Error aplicando la transformación {transformation} sobre {field}

source: No schema info for this dataset.
es: No hay informacion the esquema para este dataset

source: No data info for the field {field} in the schema.
es: No hay informacion para el campo {field} en el esquema

source: Column must be of type string to apply text standardization.
es: La columna debe ser de tipo string para aplicar la estandarizacion de texto

source: Provider in url not supported
es: El proveedor de la url no esta soportado

source: Provider not supported
es: Proveedor no soportado

source: Invalid url or file/folder doesn't not exist
es: Url invalida o archivo/carpeta no existe

source: The tables need to have the same number of columns and column names
es: Las tablas deben tener el mismo numero de columnas y nombres de columnas

source: Invalid column names in CSV:
es: Nombres de columnas inválidos en el CSV:

source: Error processing request
es: Error procesando request

source: Table not found.
es: Tabla no encontrada

source: Table transformed successfully:
es: Tabla transformada satisfactoriamente:
